In [86]:
import numpy as np
import pandas as pd

In [87]:
sozluk1 = {"Isım" : ["Ahmet","Mehmet","Zeynep","Atıl"],
           "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
           "Kalori" : [100,200,300,400]
          }

In [88]:
dataFrame1 = pd.DataFrame(sozluk1,index = [0,1,2,3])

In [89]:
dataFrame1

     Isım       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [90]:
sozluk2 = {"Isım" : ["Ahmet","Levent","Atlas","Fatma"],
           "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
           "Kalori" : [200,100,50,300]
          }

In [91]:
dataFrame2 = pd.DataFrame(sozluk2,index = [4,5,6,7])

In [92]:
sozluk3 = {"Isım" : ["Ayse","Mahmut","Duygu","Nur"],
           "Spor" : ["Koşu","Yüzme","Badminton","Tenis"],
           "Kalori" : [300,400,500,250]
          }

In [93]:
dataFrame3 = pd.DataFrame(sozluk3,index=[8,9,10,11])

In [94]:
dataFrame1

     Isım       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [95]:
dataFrame2

     Isım       Spor  Kalori
4   Ahmet       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [96]:
dataFrame3

      Isım       Spor  Kalori
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

# concatenation

In [97]:
pd.concat([dataFrame1,dataFrame2,dataFrame3]) # concat sayesinde birleşme yarıyor

      Isım       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Ahmet       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

# merge

In [98]:
mergeSozluk1 = {"Isim": ["Ahmet","Mehemt","Zeynep","Atıl"],
                "Spor": ["Koşu","Yüzme","Koşu","Basketbol"]
               }

In [99]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [100]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehemt      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [101]:
mergeSozluk2 = {"Isim": ["Ahmet","Mehemt","Zeynep","Atıl"],
                "Kalori": [100,200,150,250]
               }

In [102]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [103]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehemt     200
2  Zeynep     150
3    Atıl     250

In [104]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim") # merge ortak olmayanları yan yana getirir on sayesinde ortak olanları 
                                                    # soyleyip ortak olmayanları merge ile yan yana getirir !!!

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehemt      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

In [105]:
maasSozluk = {"Isim" : ["Atıl","Zeynep","Mehmet","Ahmet"],
             "Departman" : ["Yazılım","Satış","Pazarlama","Yazılım"],
             "Maas" : [200,300,400,500]
             }

In [106]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [107]:
maasDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [108]:
maasDataFrame["Departman"].unique() # unique sayesinde hepsinden tekil olanları alıyor

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [109]:
maasDataFrame["Departman"].nunique() # nu : number tekil olanların sayısını alıyor

3

In [110]:
maasDataFrame["Departman"].value_counts() # value_counts sayesinde her birinden kaç tane olduğunu söylüyor VALUES : değerler

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [111]:
def bruttenNete(maas):
    return maas*0.66

In [112]:
maasDataFrame["Maas"].apply(bruttenNete) # apply : uygulamak

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [113]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [117]:
yeniBirVeri = {"Karakter Sınıf" : ["South Park","South Park","Simpson","Simpson"],
              "Karakter Ismi": ["Cartman","Kenny","Homer","Bart"],
              "Karakter Yası": [9,10,15,20]
              }

In [118]:
karakterDF=pd.DataFrame(yeniBirVeri)

In [119]:
karakterDF

  Karakter Sınıf Karakter Ismi  Karakter Yası
0     South Park       Cartman              9
1     South Park         Kenny             10
2        Simpson         Homer             15
3        Simpson          Bart             20

In [124]:
karakterDF.pivot_table( "Karakter Yası", ["Karakter Sınıf","Karakter Ismi"])

                              Karakter Yası
Karakter Sınıf Karakter Ismi
Simpson        Bart                      20
               Homer                     15
South Park     Cartman                    9
               Kenny                     10